Count
Syntax
SapObject.SapModel.GDispl.Count
VB6 Procedure
Function Count() As Long
Parameters
None
Remarks
This function returns the total number of generalized displacements defined in the model.
VBA Example
Sub CountGDispls()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Count As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 3, 124, 3, 200)
 'add generalized displacement
 ret = SapModel.GDispl.Add("GD1", 1)
 'return number of generalized displacements
 Count = SapModel.GDispl.Count
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
See Also